var eventRegen =[
	["นอน",3,1,0,0],
	["ฟังเพลง",0,2,0,1],
	["กินเหล้า",-1,2,-1,1],
	["ออกกำลังกาย",1,1,0,1],
	["กิน Buffet",2,1,0,0],
	["ดูหนัง",1,2,-1,1],
	["ไปสปา",3,1,0,0],
	["ร้องคาราโอเกะ",0,2,0,1],
	["เล่นเกมส์",-1,2,-1,1],
	["ว่ายน้ำ",1,1,0,1],
	["กิน Omakase",2,1,0,0],
	["ดู Series",1,2,-1,1]
	];
var eventKnowledge=[
	["อ่าน textbook",-4,-3,5,0],
	["E-lecture",-3,-4,4,0],
	["ส่องสไลด์ Histology",-3,-3,4,1],
	["ท่องโพย",-2,0,1,0],
	["ผ่า Gross",-1,-2,2,1],
	["เข้า Journal Club",-3,-2,4,1],
	["ทำสรุป",-4,-3,5,0],
	["Prereading",-3,-4,4,0],
	["Ward Round",-3,-3,4,1],
	["ท่องข้อสอบเก่า",-2,0,1,0],
	["ออก OPD",-1,-2,2,1],
	["Review Article",-3,-2,4,1]
	];
var eventXp =[
	["ปลูกป่า",-2,3,0,4],
	["เข้า Workshop",-2,0,1,5],
	["อ่าน Non-academic Books",0,2,1,3],
	["วาดรูป",0,2,0,2],
	["เล่นหุ้น",-1,0,0,3],
	["เล่นดนตรี",-2,1,0,3],
	["ทำธง",-2,3,0,4],
	["ทำค่ายอาสา",-2,0,1,5],
	["อ่านข่าวก้าวทันโลก",0,2,1,3],
	["เดินจงกรม",0,2,0,2],
	["ขายของออนไลน์",-1,0,0,3],
	["ไป Concert",-2,1,0,3]
	];
function getRegen(){
	return eventRegen;
}
function getKnowledge(){
	return eventKnowledge;
}
function getXp(){
	return eventXp;
}

module.exports = {
	getRegen,
	getKnowledge,
	getXp
};
